In [47]:
import pandas as pd

In [48]:
reward_df= pd.read_csv('RewardsData.csv')

In [5]:
reward_df.head()

,User ID,Birthdate,City,State,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
0,1,1/31/1992,Minneapolis,Georgia,55401,300,300,0,9/4/2020 0:15,12/16/2021 17:42,ClassOf2025
1,2,NaN,Los Angeles,Colorado,90210,320,320,0,8/19/2020 11:15,4/13/2022 14:28,ClassOf2025|apple
2,3,1/11/1990,Merida,AL,97204,330,330,0,10/13/2020 16:20,4/21/2021 10:54,Freshman|Developer
3,4,4/16/1990,Winston-Salem,NC,27106,10790,14290,3500,8/18/2020 13:21,6/30/2022 22:22,GraduateStudent|admin|MBBvsDuke
4,5,3/24/1994,Winston-Salem,NC,27109,650,650,0,8/21/2020 11:27,12/30/2020 10:57,Student|NOBSBvsNDGame3|NOBSBvsNDGame3A

In [6]:
reward_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7252 entries, 0 to 7251
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   User ID              7252 non-null   int64
 1   Birthdate            1172 non-null   object
 2   City                 330 non-null    object
 3   State                330 non-null    object
 4   Zip                  330 non-null    object
 5   Available Points     7252 non-null   int64
 6   Total Points Earned  7252 non-null   int64
 7   Points Spent         7252 non-null   int64
 8   Joined On            7252 non-null   object
 9   Last Seen            7031 non-null   object
 10  Tags                 7252 non-null   object
dtypes: int64(4), object(7)
memory usage: 623.3+ KB

In [7]:
reward_df.describe()

           User ID  Available Points  Total Points Earned  Points Spent
count  7252.000000       7252.000000           7252.00000   7252.000000
mean   3621.871484       1406.701737           1596.89203    191.383067
std    2091.085954       2031.637229           2531.73693   1223.108659
min       1.000000          0.000000            100.00000      0.000000
25%    1811.750000        400.000000            400.00000      0.000000
50%    3619.500000        735.000000            800.00000      0.000000
75%    5432.250000       1550.000000           1710.00000      0.000000
max    7242.000000      52165.000000          59525.00000  57800.000000

In [9]:
reward_df.nunique()

User ID                7242
Birthdate               958
City                    149
State                    42
Zip                     170
Available Points       1022
Total Points Earned    1055
Points Spent            139
Joined On              5894
Last Seen              6078
Tags                    459
dtype: int64

In [51]:
reward_df.shape

(7252, 11)

In [10]:
# select a single column

reward_df['City']

0        Minneapolis
1        Los Angeles
2              Merida
3       Winston-Salem
4       Winston-Salem
            ...
7247              NaN
7248              NaN
7249              NaN
7250              NaN
7251              NaN
Name: City, Length: 7252, dtype: object

In [11]:
type(reward_df['City'])

pandas.core.series.Series

In [12]:
reward_df['City'].index.values

array([   0,    1,    2, ..., 7249, 7250, 7251], shape=(7252,))

In [15]:
reward_df.dtypes

User ID                 int64
Birthdate              object
City                   object
State                  object
Zip                    object
Available Points        int64
Total Points Earned     int64
Points Spent            int64
Joined On              object
Last Seen              object
Tags                   object
dtype: object

In [18]:
reward_df['Available Points']=reward_df['Available Points'].astype(float)
reward_df.dtypes

User ID                  int64
Birthdate               object
City                    object
State                   object
Zip                     object
Available Points       float64
Total Points Earned      int64
Points Spent             int64
Joined On               object
Last Seen               object
Tags                    object
dtype: object

In [21]:
locations_df= reward_df[['City','State', 'Zip']]
locations_df.head()

            City     State    Zip
0   Minneapolis    Georgia  55401
1   Los Angeles   Colorado  90210
2         Merida        AL  97204
3  Winston-Salem        NC  27106
4  Winston-Salem        NC  27109

In [22]:
reward_df.iloc[0]

User ID                               1
Birthdate                     1/31/1992
City                       Minneapolis
State                           Georgia
Zip                               55401
Available Points                  300.0
Total Points Earned                 300
Points Spent                          0
Joined On                 9/4/2020 0:15
Last Seen              12/16/2021 17:42
Tags                        ClassOf2025
Name: 0, dtype: object

In [24]:
reward_df.iloc[1:4]

,User ID,Birthdate,City,State,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
1,2,NaN,Los Angeles,Colorado,90210,320.0,320,0,8/19/2020 11:15,4/13/2022 14:28,ClassOf2025|apple
2,3,1/11/1990,Merida,AL,97204,330.0,330,0,10/13/2020 16:20,4/21/2021 10:54,Freshman|Developer
3,4,4/16/1990,Winston-Salem,NC,27106,10790.0,14290,3500,8/18/2020 13:21,6/30/2022 22:22,GraduateStudent|admin|MBBvsDuke

In [27]:
reward_df.set_index('State', inplace=True)
reward_df.head()

,User ID,Birthdate,City,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
State,,,,,,,,,,
Georgia,1,1/31/1992,Minneapolis,55401,300.0,300,0,9/4/2020 0:15,12/16/2021 17:42,ClassOf2025
Colorado,2,NaN,Los Angeles,90210,320.0,320,0,8/19/2020 11:15,4/13/2022 14:28,ClassOf2025|apple
AL,3,1/11/1990,Merida,97204,330.0,330,0,10/13/2020 16:20,4/21/2021 10:54,Freshman|Developer
NC,4,4/16/1990,Winston-Salem,27106,10790.0,14290,3500,8/18/2020 13:21,6/30/2022 22:22,GraduateStudent|admin|MBBvsDuke
NC,5,3/24/1994,Winston-Salem,27109,650.0,650,0,8/21/2020 11:27,12/30/2020 10:57,Student|NOBSBvsNDGame3|NOBSBvsNDGame3A

In [32]:
georgia_df=reward_df.loc['Georgia']
georgia_df
georgia_df.shape

(3, 10)

In [35]:
top_earners_df=reward_df[reward_df['Total Points Earned']>25000]
top_earners_df.tail()

,User ID,Birthdate,City,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
State,,,,,,,,,,
NaN,1492,8/15/1998,NaN,NaN,12600.0,33300,20700,9/28/2020 22:16,6/15/2022 23:37,ClassOf2022|MBBvsDuke|GraduateStudent
North Carolina,1611,NaN,Winston-Salem,27109,23765.0,50165,26400,9/29/2020 21:53,6/23/2022 13:54,ClassOf2024|MBBvsDuke
Massachusetts,3055,6/10/2002,Bourne,2532,10890.0,28890,18000,8/18/2021 10:05,6/24/2022 14:25,ClassOf2025|MBBvsDuke
NaN,4654,12/3/1994,NaN,NaN,2045.0,26045,24000,9/2/2021 17:43,6/30/2022 17:02,GraduateStudent
NaN,4681,1/20/1995,NaN,NaN,18190.0,26690,8500,9/2/2021 18:54,6/24/2022 14:26,GraduateStudent

In [39]:
top_earners_df.sort_values(by=['Total Points Earned'], ascending= False)

,User ID,Birthdate,City,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
State,,,,,,,,,,
NaN,107,9/2/1998,NaN,NaN,1725.0,59525,57800,9/7/2020 15:16,6/29/2022 23:53,ClassOf2025|MBBvsDuke
Illinois,1243,5/14/2002,Waukegan,60085,52165.0,52165,0,9/26/2020 1:22,6/30/2022 11:38,ClassOf2024|MBBvsDuke
North Carolina,1611,NaN,Winston-Salem,27109,23765.0,50165,26400,9/29/2020 21:53,6/23/2022 13:54,ClassOf2024|MBBvsDuke
NaN,1492,8/15/1998,NaN,NaN,12600.0,33300,20700,9/28/2020 22:16,6/15/2022 23:37,ClassOf2022|MBBvsDuke|GraduateStudent
Massachusetts,3055,6/10/2002,Bourne,2532,10890.0,28890,18000,8/18/2021 10:05,6/24/2022 14:25,ClassOf2025|MBBvsDuke
NaN,644,NaN,NaN,NaN,21115.0,28515,7400,9/10/2020 12:37,5/18/2022 13:11,ClassOf2024
NaN,4681,1/20/1995,NaN,NaN,18190.0,26690,8500,9/2/2021 18:54,6/24/2022 14:26,GraduateStudent
NaN,4654,12/3/1994,NaN,NaN,2045.0,26045,24000,9/2/2021 17:43,6/30/2022 17:02,GraduateStudent

In [41]:
top_earners_df.sort_values(by=['City','Total Points Earned'], ascending= False)

,User ID,Birthdate,City,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
State,,,,,,,,,,
North Carolina,1611,NaN,Winston-Salem,27109,23765.0,50165,26400,9/29/2020 21:53,6/23/2022 13:54,ClassOf2024|MBBvsDuke
Illinois,1243,5/14/2002,Waukegan,60085,52165.0,52165,0,9/26/2020 1:22,6/30/2022 11:38,ClassOf2024|MBBvsDuke
Massachusetts,3055,6/10/2002,Bourne,2532,10890.0,28890,18000,8/18/2021 10:05,6/24/2022 14:25,ClassOf2025|MBBvsDuke
NaN,107,9/2/1998,NaN,NaN,1725.0,59525,57800,9/7/2020 15:16,6/29/2022 23:53,ClassOf2025|MBBvsDuke
NaN,1492,8/15/1998,NaN,NaN,12600.0,33300,20700,9/28/2020 22:16,6/15/2022 23:37,ClassOf2022|MBBvsDuke|GraduateStudent
NaN,644,NaN,NaN,NaN,21115.0,28515,7400,9/10/2020 12:37,5/18/2022 13:11,ClassOf2024
NaN,4681,1/20/1995,NaN,NaN,18190.0,26690,8500,9/2/2021 18:54,6/24/2022 14:26,GraduateStudent
NaN,4654,12/3/1994,NaN,NaN,2045.0,26045,24000,9/2/2021 17:43,6/30/2022 17:02,GraduateStudent

In [45]:
top_earners_df.sort_index()

,User ID,Birthdate,City,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
State,,,,,,,,,,
Illinois,1243,5/14/2002,Waukegan,60085,52165.0,52165,0,9/26/2020 1:22,6/30/2022 11:38,ClassOf2024|MBBvsDuke
Massachusetts,3055,6/10/2002,Bourne,2532,10890.0,28890,18000,8/18/2021 10:05,6/24/2022 14:25,ClassOf2025|MBBvsDuke
North Carolina,1611,NaN,Winston-Salem,27109,23765.0,50165,26400,9/29/2020 21:53,6/23/2022 13:54,ClassOf2024|MBBvsDuke
NaN,107,9/2/1998,NaN,NaN,1725.0,59525,57800,9/7/2020 15:16,6/29/2022 23:53,ClassOf2025|MBBvsDuke
NaN,644,NaN,NaN,NaN,21115.0,28515,7400,9/10/2020 12:37,5/18/2022 13:11,ClassOf2024
NaN,1492,8/15/1998,NaN,NaN,12600.0,33300,20700,9/28/2020 22:16,6/15/2022 23:37,ClassOf2022|MBBvsDuke|GraduateStudent
NaN,4654,12/3/1994,NaN,NaN,2045.0,26045,24000,9/2/2021 17:43,6/30/2022 17:02,GraduateStudent
NaN,4681,1/20/1995,NaN,NaN,18190.0,26690,8500,9/2/2021 18:54,6/24/2022 14:26,GraduateStudent